---
kind: other
id: Properties.T:Autodesk.Revit.DB.SiteLocation
source: html/ee4cb0fe-f830-b6a0-bd34-8c9bf84deb27.htm
---
# SiteLocation Properties

The id of the assembly instance to which the element belongs.